Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-react_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: react-api title: React Top-Level API layout: docs category: Reference permalink: docs/react-api.html redirect_from:
ja: --- id: react-api title: React の最上位 API layout: docs category: Reference permalink: docs/react-api.html redirect_from:

source: `React` is the entry point to the React library.
ja: `React` は React ライブラリのエントリポイントです。

source: If you load React from a `<script>` tag, these top-level APIs are available on the `React` global.
ja: `<script>` タグから React を読み込む場合、これらの最上位 API をグローバルの `React` から利用できます。

source: If you use ES6 with npm, you can write `import React from 'react'`.
ja: npm と ES6 を使う場合、`import React from 'react'` と書けます。

source: If you use ES5 with npm, you can write `var React = require('react')`.
ja: npm と ES5 を使う場合、`var React = require('react')` と書けます。

source: ## Overview {#overview}
ja: ## 概要 {#overview}

source: ### Components {#components}
ja: ### コンポーネント {#components}

source: React components let you split the UI into independent, reusable pieces, and think about each piece in isolation.
ja: React コンポーネントを使用すると UI を独立した再利用可能な部分に分割し、各部分を個別に考えることができます。

source: React components can be defined by subclassing `React.Component` or `React.PureComponent`.
ja: React コンポーネントは `React.Component` または `React.PureComponent` をサブクラス化することで定義できます。

source: If you don't use ES6 classes, you may use the `create-react-class` module instead.
ja: ES6 クラスを使わない場合は、代わりに `create-react-class` モジュールを使うことができます。

source: See [Using React without ES6](/docs/react-without-es6.html) for more information.
ja: 詳しくは [Using React without ES6](/docs/react-without-es6.html) を参照してください。

source: React components can also be defined as functions which can be wrapped:
ja: React コンポーネントは関数で定義でき、その際に以下の関数でラップできます：

source: ### Creating React Elements {#creating-react-elements}
ja: ### React 要素を作成する {#creating-react-elements}

source: We recommend [using JSX](/docs/introducing-jsx.html) to describe what your UI should look like.
ja: UI がどのように見えるべきかを記述するために [JSX の使用](/docs/introducing-jsx.html) を推奨します。

source: Each JSX element is just syntactic sugar for calling [`React.createElement()`](#createelement).
ja: JSX のそれぞれの要素は [`React.createElement()`](#createelement) を呼ぶための単なる糖衣構文です。

source: You will not typically invoke the following methods directly if you are using JSX.
ja: JSX を使用している場合は、通常、次のメソッドを直接呼び出すことはありません。

source: See [Using React without JSX](/docs/react-without-jsx.html) for more information.
ja: 詳しくは [JSX なしで React を使う](/docs/react-without-jsx.html) を参照してください。

source: ### Transforming Elements {#transforming-elements}
ja: ### 要素を変換する {#transforming-elements}

source: `React` provides several APIs for manipulating elements:
ja: `React` は要素を操作するためのいくつかの API を提供しています。

source: ### Fragments {#fragments}
ja: ### フラグメント (Fragment) {#fragments}

source: `React` also provides a component for rendering multiple elements without a wrapper.
ja: `React` はラッパーなしで複数の要素をレンダーするためのコンポーネントを提供しています。

source: ### Suspense {#suspense}
ja: ### サスペンス (Suspense) {#suspense}

source: Suspense lets components "wait" for something before rendering.
ja: サスペンスを使用すると、コンポーネントはレンダーの前に何かを「待機」できます。

source: Today, Suspense only supports one use case: [loading components dynamically with `React.lazy`](/docs/code-splitting.html#reactlazy).
ja: 現在、サスペンスは 1 つのユースケースのみをサポートしています：[`React.lazy` を使ってコンポーネントを動的に読み込む](/docs/code-splitting.html#reactlazy)。

source: In the future, it will support other use cases like data fetching.
ja: 将来的にはデータの取得のような他のユースケースもサポートされるでしょう。

source: ### Hooks {#hooks}
ja: ### フック (hook) {#hooks}

source: *Hooks* are a new addition in React 16.8.
ja: *フック (hook)* は React 16.8 で追加された新機能です。

source: They let you use state and other React features without writing a class.
ja: state などの React の機能を、クラスを書かずに使えるようになります。

source: Hooks have a [dedicated docs section](/docs/hooks-intro.html) and a separate API reference:
ja: フックには[専用のセクション](/docs/hooks-intro.html)と別の API リファレンスがあります。

source: - [Basic Hooks](/docs/hooks-reference.html#basic-hooks)
ja: - [基本的なフック](/docs/hooks-reference.html#basic-hooks)

source: - [`useContext`](/docs/hooks-reference.html#usecontext) - [Additional Hooks](/docs/hooks-reference.html#additional-hooks)
ja: - [`useContext`](/docs/hooks-reference.html#usecontext) - [追加のフック](/docs/hooks-reference.html#additional-hooks)

source: ## Reference {#reference}
ja: ## リファレンス {#reference}

source: `React.Component` is the base class for React components when they are defined using [ES6 classes](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes):
ja: React コンポーネントが [ES6 クラス](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes) を用いて定義されている場合、`React.Component` はそれらの基底クラスになります。

source: See the [React.Component API Reference](/docs/react-component.html) for a list of methods and properties related to the base `React.Component` class.
ja: 基底クラス `React.Component` に関するメソッドとプロパティの一覧については、[React.Component API Reference](/docs/react-component.html) を参照してください。

source: `React.PureComponent` is similar to [`React.Component`](#reactcomponent).
ja: `React.PureComponent` は [`React.Component`](#reactcomponent) と似ています。

source: The difference between them is that [`React.Component`](#reactcomponent) doesn't implement [`shouldComponentUpdate()`](/docs/react-component.html#shouldcomponentupdate), but `React.PureComponent` implements it with a shallow prop and state comparison.
ja: 両者の違いは [`React.Component`](#reactcomponent) が [`shouldComponentUpdate()`](/docs/react-component.html#shouldcomponentupdate) を実装していないことに対し、`React.PureComponent` は props と state を浅く (shallow) 比較することでそれを実装していることです。

source: If your React component's `render()` function renders the same result given the same props and state, you can use `React.PureComponent` for a performance boost in some cases.
ja: React コンポーネントの `render()` 関数が同じ props と state を与えられたときに同じ結果をレンダーするときは、パフォーマンスを向上させるために `React.PureComponent` を使用できます。

source: > Note > > `React.PureComponent`'s `shouldComponentUpdate()` only shallowly compares the objects.
ja: > 補足 > > `React.PureComponent` の `shouldComponentUpdate()` は オブジェクトの浅い比較のみを行います。

source: If these contain complex data structures, it may produce false-negatives for deeper differences.
ja: これらに複雑なデータ構造が含まれていると、深い部分のみに差分があるために、本当は差分があるにも関わらず差分がないと見なされる場合があります。

source: Only extend `PureComponent` when you expect to have simple props and state, or use [`forceUpdate()`](/docs/react-component.html#forceupdate) when you know deep data structures have changed.
ja: 単純な props と state を持つ場合にのみ `PureComponent` を継承するか、深いデータ構造が変更されたとわかっているときに [`forceUpdate()`](/docs/react-component.html#forceupdate) を使用してください。

source: Or, consider using [immutable objects](https://facebook.github.io/immutable-js/) to facilitate fast comparisons of nested data.
ja: あるいは、ネストされたデータ構造の高速な比較を容易にするために [イミュータブルなオブジェクト](https://facebook.github.io/immutable-js/) の使用を検討してください。

source: > > Furthermore, `React.PureComponent`'s `shouldComponentUpdate()` skips prop updates for the whole component subtree.
ja: > > さらに、`React.PureComponent` の `shouldComponentUpdate()` はサブツリー全体のコンポーネントの props の更新をスキップします。

source: Make sure all the children components are also "pure".
ja: 子コンポーネントの全てが「純粋な」コンポーネントであることを確認してください。

source: `React.memo` is a [higher order component](/docs/higher-order-components.html).
ja: `React.memo` は[高階コンポーネント](/docs/higher-order-components.html)です。

source: If your component renders the same result given the same props, you can wrap it in a call to `React.memo` for a performance boost in some cases by memoizing the result.
ja: もしあるコンポーネントが同じ props を与えられたときに同じ結果をレンダーするなら、結果を記憶してパフォーマンスを向上させるためにそれを `React.memo` でラップすることができます。

source: This means that React will skip rendering the component, and reuse the last rendered result.
ja: つまり、React はコンポーネントのレンダーをスキップし、最後のレンダー結果を再利用します。

source: `React.memo` only checks for prop changes.
ja: `React.memo` は props の変更のみをチェックします。

source: If your function component wrapped in `React.memo` has a [`useState`](/docs/hooks-state.html), [`useReducer`](/docs/hooks-reference.html#usereducer) or [`useContext`](/docs/hooks-reference.html#usecontext) Hook in its implementation, it will still rerender when state or context change.
ja: `React.memo` でラップしているあなたのコンポーネントがその実装内で [`useState`](/docs/hooks-state.html)、[`useReducer`](/docs/hooks-reference.html#usereducer) や [`useContext`](/docs/hooks-reference.html#usecontext) フックを使っている場合、state やコンテクストの変化に応じた再レンダーは発生します。

source: By default it will only shallowly compare complex objects in the props object.
ja: デフォルトでは props オブジェクト内の複雑なオブジェクトは浅い比較のみが行われます。

source: If you want control over the comparison, you can also provide a custom comparison function as the second argument.
ja: 比較を制御したい場合は 2 番目の引数でカスタム比較関数を指定できます。

source: return true if passing nextProps to render would return
ja: nextProps を render に渡した結果が

source: the same result as passing prevProps to render,
ja: prevProps を render に渡した結果となるときに true を返し

source: otherwise return false
ja: それ以外のときに false を返す

source: This method only exists as a **[performance optimization](/docs/optimizing-performance.html).** Do not rely on it to "prevent" a render, as this can lead to bugs.
ja: これは**[パフォーマンス最適化](/docs/optimizing-performance.html)**のためだけの方法です。バグを引き起こす可能性があるため、レンダーを「抑止する」ために使用しないでください。

source: > Note > > Unlike the [`shouldComponentUpdate()`](/docs/react-component.html#shouldcomponentupdate) method on class components, the `areEqual` function returns `true` if the props are equal and `false` if the props are not equal.
ja: > 注意 > > クラスコンポーネントの [`shouldComponentUpdate()`](/docs/react-component.html#shouldcomponentupdate) とは異なり、この `areEqual` 関数は props が等しいときに `true` を返し、props が等しくないときに `false` を返します。

source: This is the inverse from `shouldComponentUpdate`.
ja: これは `shouldComponentUpdate` とは逆です。

source: Create and return a new [React element](/docs/rendering-elements.html) of the given type.
ja: 与えられた型の新しい [React 要素](/docs/rendering-elements.html)を作成して返します。

source: The type argument can be either a tag name string (such as `'div'` or `'span'`), a [React component](/docs/components-and-props.html) type (a class or a function), or a [React fragment](#reactfragment) type.
ja: `type` 引数はタグ名の文字列（`'div'` や `'span'` など）、[React component](/docs/components-and-props.html) 型（クラスもしくは関数）、[React fragment](#reactfragment) 型のいずれかです。

source: Code written with [JSX](/docs/introducing-jsx.html) will be converted to use `React.createElement()`.
ja: JSX で書かれたコードは `React.createElement()` を用いるコードに変換されます。

source: You will not typically invoke `React.createElement()` directly if you are using JSX.
ja: JSX を使っていれば通常 `React.createElement()` を直接呼び出すことはありません。

source: See [React Without JSX](/docs/react-without-jsx.html) to learn more.
ja: 詳しくは [JSX なしで React を使う](/docs/react-without-jsx.html)を参照してください。

source: Clone and return a new React element using `element` as the starting point.
ja: `element` から新しい React 要素を複製して返します。

source: The resulting element will have the original element's props with the new props merged in shallowly.
ja: 結果の要素は元の要素の props と新しい props が浅くマージされたものを持ちます。

source: New children will replace existing children.
ja: 新しい子要素は既存の子要素を置き換えます。

source: `key` and `ref` from the original element will be preserved.
ja: `key` と `ref` は元の要素から保持されます。

source: `React.cloneElement()` is almost equivalent to:
ja: `React.cloneElement()` は以下のコードとほぼ同等です：

source: However, it also preserves `ref`s.
ja: ただし、`ref` も保持されます。

source: This means that if you get a child with a `ref` on it, you won't accidentally steal it from your ancestor.
ja: つまり `ref` のある子要素を受け取っても、間違って元の React 要素から `ref` を盗むことはありません。

source: You will get the same `ref` attached to your new element.
ja: 新しい要素にも同じ `ref` が追加されます。

source: This API was introduced as a replacement of the deprecated `React.addons.cloneWithProps()`.
ja: この API は非推奨の `React.addons.cloneWithProps()` の代替として導入されました。

source: Return a function that produces React elements of a given type.
ja: 与えられた型の React 要素を生成する関数を返します。

source: Like [`React.createElement()`](#createelement), the type argument can be either a tag name string (such as `'div'` or `'span'`), a [React component](/docs/components-and-props.html) type (a class or a function), or a [React fragment](#reactfragment) type.
ja: [`React.createElement()`](#createelement) と同様に、`type` 引数はタグ名の文字列（`'div'` や `'span'` など）、[React コンポーネント](/docs/components-and-props.html)型（クラスもしくは関数）、[React フラグメント](#reactfragment)型のいずれかです。

source: This helper is considered legacy, and we encourage you to either use JSX or use `React.createElement()` directly instead.
ja: このヘルパーはレガシーだと考えられているため、代わりに JSX か `React.createElement()` を直接使用することをおすすめします。

source: You will not typically invoke `React.createFactory()` directly if you are using JSX.
ja: JSX を使っていれば通常 `React.createFactory()` を直接呼び出すことはありません。

source: Verifies the object is a React element.
ja: オブジェクトが React 要素であることを確認します。

source: Returns `true` or `false`.
ja: `true` または `false` を返します。

source: `React.Children` provides utilities for dealing with the `this.props.children` opaque data structure.
ja: `React.Children` はデータ構造が非公開の `this.props.children` を扱うためのユーティリティを提供します。

source: Invokes a function on every immediate child contained within `children` with `this` set to `thisArg`.
ja: `this` を `thisArg` に設定して、`children` 内に含まれるすべての直下の子要素に対して関数を呼び出します。

source: If `children` is an array it will be traversed and the function will be called for each child in the array.
ja: `children` が配列の場合は走査され、配列の各要素に対して関数が呼び出されます。

source: If children is `null` or `undefined`, this method will return `null` or `undefined` rather than an array.
ja: `children` が `null` または `undefined` の場合はこのメソッドは配列ではなく `null` または `undefined` を返します。

source: > Note > > If `children` is a `Fragment` it will be treated as a single child and not traversed.
ja: > 補足 > > `children` が `Fragment` の場合、それは 1 つの子要素として扱われ、走査されません。

source: Like [`React.Children.map()`](#reactchildrenmap) but does not return an array.
ja: [`React.Children.map()`](#reactchildrenmap) と似ていますが、配列を返しません。

source: Returns the total number of components in `children`, equal to the number of times that a callback passed to `map` or `forEach` would be invoked.
ja: `children` に含まれるコンポーネントの総数を返します。これは `map` または `forEach` に渡したコールバックが呼ばれる回数と同じです。

source: Verifies that `children` has only one child (a React element) and returns it.
ja: `children` が 1 つの子要素しか持たないことを確認し、結果を返します。

source: Otherwise this method throws an error.
ja: そうでない場合、このメソッドはエラーを投げます。

source: > Note: > >`React.Children.only()` does not accept the return value of [`React.Children.map()`](#reactchildrenmap) because it is an array rather than a React element.
ja: > 補足: > > [`React.Children.map()`](#reactchildrenmap) の返り値は React 要素ではなく配列なため、`React.Children.only()` はそれを受け付けません。

source: Returns the `children` opaque data structure as a flat array with keys assigned to each child.
ja: データ構造が非公開の `children` を平坦な配列として返し、それぞれの要素に key を割り当てます。

source: Useful if you want to manipulate collections of children in your render methods, especially if you want to reorder or slice `this.props.children` before passing it down.
ja: レンダーメソッド内で子の集合を操作したい場合、特に `this.props.children` を渡す前に並べ替えたりスライスしたい場合に便利です。

source: > Note: > > `React.Children.toArray()` changes keys to preserve the semantics of nested arrays when flattening lists of children.
ja: > 補足: > > `React.Children.toArray()` は子のリストを平坦にするときにネストされた配列の意味を保つために key を変更します。

source: That is, `toArray` prefixes each key in the returned array so that each element's key is scoped to the input array containing it.
ja: つまり、`toArray` は配列のそれぞれの要素の key に接頭辞を付けて返します。

source: The `React.Fragment` component lets you return multiple elements in a `render()` method without creating an additional DOM element:
ja: `React.Fragment` コンポーネントを使用すると追加の DOM 要素を作成することなく `render()` メソッドで複数の要素を返すことができます。

source: You can also use it with the shorthand `<></>` syntax.
ja: また、フラグメントを `<></>` という短縮構文で使用できます。

source: For more information, see [React v16.2.0: Improved Support for Fragments](/blog/2017/11/28/react-v16.2.0-fragment-support.html).
ja: 詳しくは [React v16.2.0: Improved Support for Fragments](/blog/2017/11/28/react-v16.2.0-fragment-support.html) を参照してください。

source: `React.createRef` creates a [ref](/docs/refs-and-the-dom.html) that can be attached to React elements via the ref attribute.
ja: `React.createRef` は [ref](/docs/refs-and-the-dom.html) を作成します。ref は `ref` 属性を介して React 要素に取り付けることができます。

source: `React.forwardRef` creates a React component that forwards the [ref](/docs/refs-and-the-dom.html) attribute it receives to another component below in the tree.
ja: `React.forwardRef` は [ref](/docs/refs-and-the-dom.html) を配下のツリーの別のコンポーネントに受け渡す React コンポーネントを作成します。

source: This technique is not very common but is particularly useful in two scenarios:
ja: この手法はあまり一般的ではありませんが、2 つのシナリオで特に役立ちます：

source: `React.forwardRef` accepts a rendering function as an argument.
ja: `React.forwardRef` はレンダー関数を引数として受け入れます。

source: React will call this function with `props` and `ref` as two arguments.
ja: React は props と ref を 2 つの引数として呼び出します。

source: This function should return a React node.
ja: この関数は React ノードを返す必要があります。

source: In the above example, React passes a `ref` given to `<FancyButton ref={ref}>` element as a second argument to the rendering function inside the `React.forwardRef` call.
ja: 上の例では、React は `<FancyButton ref={ref}>` 要素に与えた `ref` を `React.forwardRef` の呼び出し内のレンダー関数の 2 番目の引数として渡します。

source: This rendering function passes the `ref` to the `<button ref={ref}>` element.
ja: このレンダー関数は `ref` を `<button ref={ref}>` 要素に渡します。

source: As a result, after React attaches the ref, `ref.current` will point directly to the `<button>` DOM element instance.
ja: 結果として、React が `ref` を取り付けた後、`ref.current` は `<button>` の DOM 要素のインスタンスを直接指すようになります。

source: For more information, see [forwarding refs](/docs/forwarding-refs.html).
ja: 詳しくは [forwarding refs](/docs/forwarding-refs.html) を参照してください。

source: `React.lazy()` lets you define a component that is loaded dynamically.
ja: `React.lazy()` を使用すると、動的に読み込まれるコンポーネントを定義できます。

source: This helps reduce the bundle size to delay loading components that aren't used during the initial render.
ja: これにより、バンドルサイズを削減して、最初のレンダー時に使用されないコンポーネントの読み込みを遅らせることができます。

source: You can learn how to use it from our [code splitting documentation](/docs/code-splitting.html#reactlazy).
ja: [code splitting のドキュメント](/docs/code-splitting.html#reactlazy)から使用方法を学ぶことができます。

source: You might also want to check out [this article](https://medium.com/@pomber/lazy-loading-and-preloading-components-in-react-16-6-804de091c82d) explaining how to use it in more detail.
ja: また、使い方をより詳しく説明した[こちらの記事](https://medium.com/@pomber/lazy-loading-and-preloading-components-in-react-16-6-804de091c82d)もチェックしてみてください。

source: Note that rendering `lazy` components requires that there's a `<React.Suspense>` component higher in the rendering tree.
ja: `lazy` コンポーネントをレンダーするには `<React.Suspense>` がレンダリングツリーの上位に必要です。

source: This is how you specify a loading indicator.
ja: これはローディングインジケータを指定する方法です。

source: > **Note** > > Using `React.lazy`with dynamic import requires Promises to be available in the JS environment.
ja: > **補足** > > `React.lazy` を使って動的にインポートするには JS 環境で Promise が使用できる必要があります。

source: This requires a polyfill on IE11 and below.
ja: これは IE11 以前の環境ではポリフィルが必要だということです。

source: `React.Suspense` lets you specify the loading indicator in case some components in the tree below it are not yet ready to render.
ja: `React.Suspense` を使用することで、その配下にレンダーする準備ができていないコンポーネントがあるときにローディングインジケータを指定できます。

source: Today, lazy loading components is the **only** use case supported by `<React.Suspense>`:
ja: 現在、遅延読み込みコンポーネントは `<React.Suspense>` のみによってサポートされています。

source: It is documented in our [code splitting guide](/docs/code-splitting.html#reactlazy).
ja: これは [code splitting guide](/docs/code-splitting.html#reactlazy) で文書化されています。

source: Note that `lazy` components can be deep inside the `Suspense` tree -- it doesn't have to wrap every one of them.
ja: 遅延される (lazy) コンポーネントを `Suspense` ツリーの奥深くに置くことができ、それらを 1 つずつラップする必要はありません。

source: The best practice is to place `<Suspense>` where you want to see a loading indicator, but to use `lazy()` wherever you want to do code splitting.
ja: ベストプラクティスは `<Suspense>` をローディングインジケータを表示したい場所に配置することですが、コードを分割したい場合は `lazy()` を使用してください。

source: While this is not supported today, in the future we plan to let `Suspense` handle more scenarios such as data fetching.
ja: これらは現在サポートされていませんが、将来的には `Suspense` にデータの取得などのより多くのシナリオを処理させる予定です。

source: You can read about this in [our roadmap](/blog/2018/11/27/react-16-roadmap.html).
ja: これについては[ロードマップ](/blog/2018/11/27/react-16-roadmap.html)で読めます。

source: >Note: > >`React.lazy()` and `<React.Suspense>` are not yet supported by `ReactDOMServer`.
ja: >注意: > >`React.lazy()` と `<React.Suspense>` は `ReactDOMServer` ではまだサポートされていません。

source: This is a known limitation that will be resolved in the future.
ja: これは既知の制限であり、今後解決されます。
